import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-my-news',
  templateUrl: './my-news.component.html',
  styleUrls: ['./my-news.component.scss']
})
export class MyNewsComponent implements OnInit {
  public ads: any = [
    {
      id: 1,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 2,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 3,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 1,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 2,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 3,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 1,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 2,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 3,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 1,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 2,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    },
    {
      id: 3,
      price: '120 000 000 тг.',
      status: 'активное',
      description: 'Производственный комплекс, завод очень прибыльный продаю в связи с открытием ...',
      revenue: '120 000 тг / мес',
      expenses: '50 000 тг / мес',
      views: '382',
      time: 'сегодня 14:45'
    }
  ];

  constructor() { }

  ngOnInit(): void {
  }

}
